%-------Task_2_3_2020----------

subplot(5,1,1);
y=dsolve('Dy=-10000*y','y(0)=1')
t=0:0.00001:0.00065;
y=exp(-10000*t);
plot(t,y);
hold on
grid on
%€вный метод Ёйлера
F = @(t,y) -10000*y;
tI = 0;
tEnd = 0.00065;
dt = 0.0001;
t = tI:dt:tEnd;
y = zeros(size(t));
y(1) = 1;
for k = 2:numel(y)
    yPrime = F(t(k-1),y(k-1));
    y(k) = y(k-1) + dt*yPrime;
end
plot(t,y);
title('шаг = 0.0001');

%не€вный метод Ёйлера
tI = 0;
tEnd = 0.00065;
dt = 0.0001;
t = tI:dt:tEnd;
y = zeros(size(t));
y(1) = 1;
for k = 2:numel(y)
    y(k) = y(k-1)/(1+10000*dt);
end
plot(t,y);
legend('dsolve','€вный','не€вный');

subplot(5,1,2);
y=dsolve('Dy=-10000*y','y(0)=1')
t=0:0.00001:0.00065;
y=exp(-10000*t);
plot(t,y);
hold on
grid on
%€вный метод Ёйлера
F = @(t,y) -10000*y;
tI = 0;
tEnd = 0.00065;
dt = 0.00009;
t = tI:dt:tEnd;
y = zeros(size(t));
y(1) = 1;
for k = 2:numel(y)
    yPrime = F(t(k-1),y(k-1));
    y(k) = y(k-1) + dt*yPrime;
end
plot(t,y);
title('шаг = 0.00009');

%не€вный метод Ёйлера
tI = 0;
tEnd = 0.00065;
dt = 0.00009;
t = tI:dt:tEnd;
y = zeros(size(t));
y(1) = 1;
for k = 2:numel(y)
    y(k) = y(k-1)/(1+10000*dt);
end
plot(t,y);
legend('dsolve','€вный','не€вный');

subplot(5,1,3);
y=dsolve('Dy=-10000*y','y(0)=1')
t=0:0.00001:0.00065;
y=exp(-10000*t);
plot(t,y);
hold on
grid on
%€вный метод Ёйлера
F = @(t,y) -10000*y;
tI = 0;
tEnd = 0.00065;
dt = 0.00005;
t = tI:dt:tEnd;
y = zeros(size(t));
y(1) = 1;
for k = 2:numel(y)
    yPrime = F(t(k-1),y(k-1));
    y(k) = y(k-1) + dt*yPrime;
end
plot(t,y);
title('шаг = 0.00005');

%не€вный метод Ёйлера
tI = 0;
tEnd = 0.00065;
dt = 0.00005;
t = tI:dt:tEnd;
y = zeros(size(t));
y(1) = 1;
for k = 2:numel(y)
    y(k) = y(k-1)/(1+10000*dt);
end
plot(t,y);
legend('dsolve','€вный','не€вный');

subplot(5,1,4);
y=dsolve('Dy=-10000*y','y(0)=1')
t=0:0.00001:0.00065;
y=exp(-10000*t);
plot(t,y);
hold on
grid on
%€вный метод Ёйлера
F = @(t,y) -10000*y;
tI = 0;
tEnd = 0.00065;
dt = 0.00001;
t = tI:dt:tEnd;
y = zeros(size(t));
y(1) = 1;
for k = 2:numel(y)
    yPrime = F(t(k-1),y(k-1));
    y(k) = y(k-1) + dt*yPrime;
end
plot(t,y);
title('шаг = 0.00001');

%не€вный метод Ёйлера
tI = 0;
tEnd = 0.00065;
dt = 0.00001;
t = tI:dt:tEnd;
y = zeros(size(t));
y(1) = 1;
for k = 2:numel(y)
    y(k) = y(k-1)/(1+10000*dt);
end
plot(t,y);
legend('dsolve','€вный','не€вный');

subplot(5,1,5);
y=dsolve('Dy=-10000*y','y(0)=1')
t=0:0.00001:0.00065;
y=exp(-10000*t);
plot(t,y);
hold on
grid on
%€вный метод Ёйлера
F = @(t,y) -10000*y;
tI = 0;
tEnd = 0.00065;
dt = 0.000005;
t = tI:dt:tEnd;
y = zeros(size(t));
y(1) = 1;
for k = 2:numel(y)
    yPrime = F(t(k-1),y(k-1));
    y(k) = y(k-1) + dt*yPrime;
end
plot(t,y);
title('шаг = 0.000005');

%не€вный метод Ёйлера
tI = 0;
tEnd = 0.00065;
dt = 0.000005;
t = tI:dt:tEnd;
y = zeros(size(t));
y(1) = 1;
for k = 2:numel(y)
    y(k) = y(k-1)/(1+10000*dt);
end
plot(t,y);
legend('dsolve','€вный','не€вный');


%€вный метод Ёйлера €вл€етс€ условно устойчивым. Ќа него сильно вли€ет
%размер шага, так как при относительно больших шагах у нас возникает
%больша€ разнциа с точным решением. ¬ област€х медленного изменени€ 
%решени€, казалось бы, шаг можно увеличить, однако условие устойчивости не 
%позволит это сделать, и мы вынуждены продолжать считать с малым шагом. ¬ 
%этом заключаетс€ проблема при численном решении жестких уравнений.

%не€вный метод Ёйлера €вл€етс€ ј-устойчивым. “аким  образом,  не€вный 
%метод  Ёйлера  не  предполагает  никаких  ограничений  на  шаг метода. 
%ѕоэтому область быстрого изменени€ решени€ можно пройти с малым шагом, 
%а в области  медленного  изменени€  шаг  увеличить настолько, насколько  
%позвол€ют соображени€ точности.

%отсюда и из полученных результатов можно пон€ть, что у не€вного метода Ёйлера
%преимуществ здесь больше, так как ошибки при разных шагах меньше, чем у
%€вного. ќднако, не смотр€ на удобство отсутстви€ органичений на шаг у
%не€вного метода, €вный имеет одно преимущество: дл€ его решени€ не надо
%выводить никакие новые формулы, в то врем€ как в не€вном случае необходимо
%найти заивисимоть следующего элемента от предыдущего, что, однако, не всегда
%лекго.